---
type: ViewFamilyType
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# ViewFamilyType

`Autodesk.Revit.DB.ViewFamilyType` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsValidDefaultTemplate | 2013 | `public bool IsValidDefaultTemplate ( ElementId templateId )` |
| Property | DefaultTemplateId | 2013 | `public ElementId DefaultTemplateId { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | PlanViewDirection | 2013 | `public PlanViewDirection PlanViewDirection { get ; set ; }` |
| Property | ViewFamily | 2013 | `public ViewFamily ViewFamily { get ; }` |